apply() - calculate project salary next year

In [29]:
#import necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

#load dataset
dataset=load_dataset('lukebarousse/data_jobs')
df=dataset['train'].to_pandas()

#data cleanup
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

In [30]:
df['salary_year_avg']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
785736   NaN
785737   NaN
785738   NaN
785739   NaN
785740   NaN
Name: salary_year_avg, Length: 785741, dtype: float64

In [31]:
#Gets only the non-empty salary values from your job data
#in my df im applying pd.notna to get only the not empty values
#by accessing the salary_year_avg col of my df and after filtering show only the salary_year_avg column with non empty values
#df[pd.notna(df['salary_year_avg'])]['salary_year_avg']
#df[pd.notna(df['salary_year_avg'])]['salary_year_avg']
df_salary=df[pd.notna(df['salary_year_avg'])]
df_salary

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,NaN,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd..."
77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,NaN,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,NaN,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}"
100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,NaN,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr..."
109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,NaN,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785624,Data Engineer,Data Analytics Engineer (Hybrid),"Mt Prospect, IL",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-08-31 06:02:16,False,True,United States,year,139216.0,NaN,Bosch Group,"['go', 'python', 'r', 'sql', 'oracle', 'window...","{'analyst_tools': ['alteryx', 'power bi', 'tab..."
785641,Data Engineer,Data Engineer,"New York, NY",via Dice,Full-time,False,Georgia,2023-01-04 16:36:07,True,False,United States,year,150000.0,NaN,"Engage Partners, Inc.",None,None
785648,Data Scientist,Director Data Scientist - Commercial Platforms...,"Pleasant Hill, CA",via Ai-Jobs.net,Full-time,False,"California, United States",2023-04-12 06:02:51,False,True,United States,year,221875.0,NaN,84.51°,"['python', 'azure', 'snowflake', 'spark']","{'cloud': ['azure', 'snowflake'], 'libraries':..."
785682,Data Scientist,Data Scientist für datengetriebene Entwicklung...,"Reutlingen, Germany",via Ai-Jobs.net,Full-time,False,Germany,2023-03-04 06:16:08,False,False,Germany,year,157500.0,NaN,Bosch Group,"['python', 'hadoop', 'spark', 'airflow', 'kube...","{'libraries': ['hadoop', 'spark', 'airflow'], ..."
785692,Data Scientist,Data Scientist- Hybrid Work Location,"Dayton, OH",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-04-21 06:02:31,False,True,United States,year,157500.0,NaN,Tenet3,"['python', 'matlab', 'r']","{'programming': ['python', 'matlab', 'r']}"

In [32]:
#since we want to find the projected year salary for the next year well try to find the inflation
#lets say for next year the inflation is salary*1.03
#therefore lets create a function to find the inflation
def projected_salary(salary):
    return salary * 1.03

#now we access the salary_year_avg col from our df_salary dataframe and apply the function to all the salaries
df_salary['salary_year_avg'].apply(projected_salary)

28        112785.00
77        144200.00
92        123600.00
100       235068.66
109        91670.00
            ...
785624    143392.48
785641    154500.00
785648    228531.25
785682    162225.00
785692    162225.00
Name: salary_year_avg, Length: 22003, dtype: float64

In [33]:
''' 
def project_salary(salary):
return salary*1.03

->Creates a function that takes any salary
->Multiplies it by 1.03 (which means +3% increase)
->Returns the new, higher salary

df_salary['salary_year_avg'].apply(projected_salary):

->Takes the salary column from your DataFrame
->Applies the projected_salary function to every single salary
->Returns a new Series with all the increased salaries
'''

" \ndef project_salary(salary):\nreturn salary*1.03\n\n->Creates a function that takes any salary\n->Multiplies it by 1.03 (which means +3% increase)\n->Returns the new, higher salary\n\ndf_salary['salary_year_avg'].apply(projected_salary):\n\n->Takes the salary column from your DataFrame\n->Applies the projected_salary function to every single salary\n->Returns a new Series with all the increased salaries\n"

In [34]:
#lets just create a new column called salary_year_inflated in our dataframe df_salary
df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(projected_salary)
#then show both the columns
#so well access the salary_year_inflated and salary_year_avg col from our df_salary dataframe
df_salary[['salary_year_avg','salary_year_inflated']]

C:\Users\saxen\AppData\Local\Temp\ipykernel_2816\1231011036.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(projected_salary)

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [35]:
#even simpler code is using lambda
df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(lambda salary: salary*1.03)
df_salary[['salary_year_avg','salary_year_inflated']]

C:\Users\saxen\AppData\Local\Temp\ipykernel_2816\1954620912.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(lambda salary: salary*1.03)

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [36]:
#accessing the job_skills col from my df and getting the value of the 1st row
df['job_skills'][1]

"['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']"

In [37]:
#now we will get the type
type(df['job_skills'][1])

str

In [38]:
#now we need to convert this string to list
#we need to import the ast library
#so here we converted this rows datatype from string to list
import ast
ast.literal_eval(df['job_skills'][1])

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [39]:
#now we converted this to a list
#so what we did first was converting this string to list
#now we will clean up this col using apply method
#now we will define a function that will convert job_skills col values from string to list
def clean_list(skill_list):
    #make sure that the value is not empty if not empty then only convert string to list
    if pd.notna(skill_list):
        return ast.literal_eval(skill_list)

#so above we defined a function that converts string to list
#now we will apply this function to all values of the job_skills col
#so im accessing the job_skills col from my dataframe and applying clean_list function on all values of that col to convert dtype from string to list
df['job_skills']=df['job_skills'].apply(clean_list)

In [40]:
df['job_skills'][1]

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [41]:
''' 
1.first we accessed the job_skills col from the df
2.we saw that we need to clean up the col
as values were inform of string and not list
3.we accessed the first row of the job_skills=>df['job_skills'][0]
4.then we imported the ast library and converted that rows dtype from string to list
ast.literal_eval(df['job_skills'][0])
5.now we need to clean up the entire col that means change all values dtype from string to list of that col
6.so we defined a function clean_list which takes each skill from the job_list and converts it into list but first make sure that the skill is not empty
def clean_list(skill_list):
if pd.notna(skill_list):
return ast.literal_eval(skill_list)
7.then apply this function to all the values of that col
df['job_skills'].apply(clean_list)
'''

" \n1.first we accessed the job_skills col from the df\n2.we saw that we need to clean up the col\nas values were inform of string and not list\n3.we accessed the first row of the job_skills=>df['job_skills'][0]\n4.then we imported the ast library and converted that rows dtype from string to list\nast.literal_eval(df['job_skills'][0])\n5.now we need to clean up the entire col that means change all values dtype from string to list of that col\n6.so we defined a function clean_list which takes each skill from the job_list and converts it into list but first make sure that the skill is not empty\ndef clean_list(skill_list):\nif pd.notna(skill_list):\nreturn ast.literal_eval(skill_list)\n7.then apply this function to all the values of that col\ndf['job_skills'].apply(clean_list)\n"

now we applied the apply() method to a col we might also need to apply it to a row

calculate projected salary next year

senior roles assume 5%
other roles assume 3%

In [42]:
#so i created a new col salary_inflated by accessing the salary_year_avg and applying the apply() method and using lambda
#df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(lambda salary: salary*1.03)
#df_salary[['salary_year_avg','salary_year_inflated']]

In [45]:
#so in the above code we applied the apply method to a col by writing df['salary_year_avg']
#if we want to apply it on a row we dont have to mention the column just mention the df (only df.apply(method name,axis))
#first lets define the method and inside it we will be passing in the row
def projected_salary(row):
    #if the word senior is present in the row of the colum that we are checking(job_title_short)
    #then return the row of the salary_year_avg*1.05
    if "Senior" in row['job_title_short']:
        return 1.05*row['salary_year_avg']
    else:
        #if senior not present in the rows of the job_title_short col then return the row of the salary_year_avg but multiply by 1.03
        return 1.03*row['salary_year_avg']
    
#so now we craeted a new col salary_year_inflated of the df_salary by accessing the df_salary dataframe (as we want to apply the apply method on all the rows) and applying the apply(projected_salary) method to each rows
#we will apply the apply() method to the entire dataframe and not just to one particlar col
df_salary['salary_year_inflated']=df_salary.apply(projected_salary,axis=1)
df_salary[['job_title_short','salary_year_avg','salary_year_inflated']]

C:\Users\saxen\AppData\Local\Temp\ipykernel_2816\3438433726.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary['salary_year_inflated']=df_salary.apply(projected_salary,axis=1)

       job_title_short  salary_year_avg  salary_year_inflated
28      Data Scientist         109500.0             112785.00
77       Data Engineer         140000.0             144200.00
92       Data Engineer         120000.0             123600.00
100     Data Scientist         228222.0             235068.66
109       Data Analyst          89000.0              91670.00
...                ...              ...                   ...
785624   Data Engineer         139216.0             143392.48
785641   Data Engineer         150000.0             154500.00
785648  Data Scientist         221875.0             228531.25
785682  Data Scientist         157500.0             162225.00
785692  Data Scientist         157500.0             162225.00

[22003 rows x 3 columns]

In [ ]:
''' 
whats happening here:
It gives Senior roles a 5% higher salary increase than other roles(3%)

def projected_salary(row):
    if "Senior" in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
->Checks each job title for the word "Senior"
->If the job title contains "Senior" → gives a 5% raise (× 1.05)
->For other roles → the function currently doesn't return anything (would need an else statement)

eg:
Job Title              | Current Salary
Senior Data Scientist  | 120,000
Data Analyst           | 80,000
Senior Data Engineer   | 130,000
Junior Developer       | 70,000

o/p:
Senior Data Scientist  → 126,000  (120,000 × 1.05)
Data Analyst           → 80000*1.03
Senior Data Engineer   → 136,500  (130,000 × 1.05)
Junior Developer       → 70000*1.03


'''

In [ ]:
''' 
we want to use the apply() on rows now
if senior word is present in the row of the job_title_short col
then salary will increase by 5% else 3% (return row f slary_year_avg*1.05)
so we define a function and pass each row
def prj_sal(row):
if "Senior" in row['job_title_short']:
return 1.05*row['salary_year_avg']
else:
return 1.03*row['salary_year_avg']

df_salary['salary_year_inflated']=df_salary.apply(prj_salary,axis=1)
'''